import cv2
import numpy as np 

img = np.ones((1000, 1000, 3)) * 255

direction = 'CCW'
s_angle = 512.18140
e_angle = 387.8183218

if direction == 'CCW':
    s = 360 - e_angle
    e = 360 - s_angle

    if s > e : 
        e = e + 360

print(s, e)

# 원점 (50,300), 반지름50, 회전0, 0도부터 360도 그리기
cv2.ellipse(img, (150, 150), (13, 13), 0, 360 - 387.8183218, 360 - 512.18140 + 360, (0,0,255))


s_angle = 332.1814016
e_angle = 207.818321

if direction == 'CCW':
    s = 360 - e_angle
    e = 360 - s_angle

    if s > e : 
        e = e + 360

print(s, e)

# cv2.ellipse(img, (300, 150), (30, 30), 0, s, e, (0, 0, 255))
cv2.ellipse(img, (300, 150), (13, 13), 0, 152.18, 387.81, (0, 0, 255))


# cv2.ellipse(img, (150, 300), (50, 50), 0, -30, 90, (0, 0, 255))
# cv2.ellipse(img, (300,300), (50,50), 0,-30 + 360, -90 + 360, (0,0,255))


# 원점 (150,300), 아래 반원 그리기
# cv2.ellipse(img, (150,300), (50,50), 0, 0, 180, (255,0,0))
# # 원점 (200,300), 아래 반원 그리기
# cv2.ellipse(img, (200,300), (50,50), 0, 181, 360, (0,0,255))

# # 원점 (325,300), 반지름(75, 50) 아래 반원 그리기
# cv2.ellipse(img, (325,300), (75, 50), 0, 0, 360, (0,255,0))
# # 원점 (450,300), 반지름(50, 75) 아래 반원 그리기
# cv2.ellipse(img, (450,300), (50,75), 0, 0, 360, (255,0,255))

# # 원점 (50,425), 반지름(50, 75) 회전15
# cv2.ellipse(img, (50,425), (50, 75), 15, 0, 360, (0,0,0))
# # 원점 (200,425), 반지름(50, 75) 회전45
# cv2.ellipse(img, (200,425), (50, 75), 45, 0, 360, (0,0,0))

# # 원점 (350,425), 홀쭊한 타원45도 회전 후 아래 반원 그리기
# cv2.ellipse(img, (350,425), (50, 75), 45, 0, 180, (0,0,255))
# # 원점 (400,425), 홀쭊한 타원45도 회전 후 위 반원 그리기
# cv2.ellipse(img, (400,425), (50, 75), 45, 181, 360, (255,0,0))

cv2.imshow('circle', img)
cv2.waitKey(0)
cv2.destroyAllWindows()